app/Controllers/Product.php

SELECT *
FROM `products`
---
    public function index() {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();

INSERT INTO `products` (`name`, `price`, `stock`, `description`, `img`) VALUES ('ambalabu', '10000000', '10', 'boneka ambalabu yang sangat populer', 'ambalabuu.jpg')
---
    public function addproduct(){
        $img = $this->request->getFile('imgInp');

        $img->move('assets');

        $data = [
            'name' => $this->request->getPost('name'),
            'price' => $this->request->getPost('price'),
            'stock' => $this->request->getPost('stock'),
            'description' => $this->request->getPost('description'),
            'category_id' => $this->request->getPost('kategori'),
            'img' => $img->getName(),
        ];

        // dd($data);

        $this->productModel->save($data);

DELETE FROM `products`
WHERE `product_id` = '6'
---
    public function delproduct($id)
    {
        $cartModel = new CartModel();
        $cartModel->where('product_id', $id)->delete();