app/Controllers/Register.php

    public function save(){

        $user = new UserModel();

        if($this->request->getPost('captcha') == $this->captcha){
            $user->save([
                'email' => $this->request->getPost('email'),
                'username' => $this->request->getPost('username'),
                'password' => $this->request->getPost('password'),

            ]);
---
INSERT INTO `users` (`email`, `username`, `password`) VALUES ('jowo@gamil.com', 'awoo', 'okio')