app/Controllers/Service.php

INSERT INTO `users` (`email`, `username`, `password`, `created_at`) VALUES ('jago@ngoding.com', 'jokow', 'iiii', '2024-12-07 04:07:26')
---
    public function save(){

        $user = new UserModel();

        if($this->request->getPost('captcha') == $this->request->getPost('captcha-random')){
            $user->save([
                'email' => $this->request->getPost('email'),
                'username' => $this->request->getPost('username'),
                'password' => $this->request->getPost('password'),

            ]);