app/Models/AdminModel.php

    public function getData($username) {
        //untuk ambil data
        $builder = $this->table($this->table);
        $builder->where('username=', $username);
        $query = $builder->get();
---
SELECT *
FROM `admin`
WHERE `username` = 'adan'