app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'juki'
AND `password` = 'jowo'
---
    public function getData($username, $password) {
        return $this->db->table('users')->where(array('username' => $username, 'password' => $password))->get()->getRowArray();